#include <stdlib.h>
#include <stdio.h>
#include "LinkedStack.h"
#include "mazeutil.h"

/*************************************************/
/* 函数名:		InitMaze(int size)
/* 函数功能:	初始化迷宫,分配空间,并将所有点置为0
/* 输入参数		size--迷宫大小
/* 返回值:		用邻接矩阵表示的图
/*************************************************/
Maze* InitMaze(int size)
{
	
}

/*************************************************/
/* 函数名:		ReadMaze(Maze* maze)
/* 函数功能:	读入迷宫结构,0代表可以走的路,1代表墙
/* 输入参数		maze--二维数组表示的地图
/* 返回值:		无
/*************************************************/
void ReadMaze(Maze* maze)
{
	
}

/*************************************************/
/* 函数名:		WriteMaze(Maze* maze)
/* 函数功能:	将迷宫的结构显示出来
/* 输入参数		maze--迷宫
/* 返回值:		无
/*************************************************/
void WriteMaze(Maze* maze)
{
	
}